#include <iostream> // Подключаем заголовочный файл
#include <string> // Подключаем файл для использования типа данных string
#include <Windows.h> // Используем файл для того, чтобы Кириллица работала корректно при выводе текста
using namespace std; // Открываем стандартное пространство имен
int main() { // Объявляем главную функцию
	SetConsoleCP(1251); // Установка кодировки UTF - 8 в консоли на ввод
	SetConsoleOutputCP(1251); // Установка кодировки UTF - 8 в консоли на вывод
	string color; // Вводим переменную
	cout << "Введите цвет: ";
	cin >> color;
	if (color == "красный" || color == "red"){ // Задаем условия
		cout << "Действие: Стоять!";
	}
else if (color == "желтый" || color == "yellow") {
		cout << "Действие: Приготовиться!";
	}
else if (color == "зеленый" || color == "green") {
		cout << "Действие: Идти!";
	}
else {
		cout << "Повторите ввод: ";
	}
	return 0; // Сообщаем, что программа завершена успешно
}
