#include<iostream> // Подключаем заголовочный файл
#include<windows.h> // Используем файл для того, чтобы Кириллица работала корректно при выводе текста
using namespace std; // Открываем стандартное пространство имен
int main() { // Объявляем главную функцию
	SetConsoleCP(1251); // Установка кодировки UTF - 8 в консоли на ввод
	SetConsoleOutputCP(1251); // Установка кодировки UTF - 8 в консоли на вывод
	int a; // Вводим переменную
	cout << "Введите число: ";
	cin >> a;
	if (a < 0 && a % 2 == 0) { // Задаем условие
		cout << "Отрицательное, четное";
	}
	else if (a < 0 && a % 2 != 0) {
		cout << "Отрицательное, нечетное";
	}
	else if (a > 0 && a % 2 == 0) {
		cout << "Положительное, четное";
	}
	else if (a > 0 && a % 2 != 0) {
		cout << "Положительное, нечетное";
	}
	else {
		cout << "Ноль, четное";
	}
	return 0; // Сообщаем, что программа завершена успешно
}
