#include <iostream> // Подключаем заголовочный файл
#include <windows.h> // Используем файл для того, чтобы Кириллица работала корректно при выводе текста
using namespace std; // Открываем стандартное пространство имен
int main() { // Объявляем главную функцию
	SetConsoleCP(65001); // Установка кодировки UTF - 8 в консоли на ввод
	SetConsoleOutputCP(65001); // Установка кодировки UTF - 8 в консоли на вывод
	int a; // Подключаем переменную
	cout << "Введите число: ";
	cin >> a;
	if (a % 5 == 0) { // Задаем функцию и прописываем условия
		cout << "Кратно 5";
	}
	else {
		cout << "Остаток от деления равен " << a % 5 << endl;
	}
	return 0; // Сообщаем, что программа завершена успешно
}
